zephyrproject-rtos/zephyr/ext/hal/silabs/gecko/Device/SiliconLabs/EFM32PG12B/Include/efm32pg12b_csen.h
/* Bit fields for CSEN DMCFG */
#define _CSEN_DMCFG_RESETVALUE                               0x00000000UL                        /**< Default value for CSEN_DMCFG */
#define _CSEN_DMCFG_MASK                                     0x103F0FFFUL                        /**< Mask for CSEN_DMCFG */
#define _CSEN_DMCFG_DMG_SHIFT                                0                                   /**< Shift value for CSEN_DMG */
#define _CSEN_DMCFG_DMG_MASK                                 0xFFUL                              /**< Bit mask for CSEN_DMG */
#define _CSEN_DMCFG_DMG_DEFAULT                              0x00000000UL                        /**< Mode DEFAULT for CSEN_DMCFG */
#define CSEN_DMCFG_DMG_DEFAULT                               (_CSEN_DMCFG_DMG_DEFAULT << 0)      /**< Shifted mode DEFAULT for CSEN_DMCFG */
#define _CSEN_DMCFG_DMR_SHIFT                                8                                   /**< Shift value for CSEN_DMR */
#define _CSEN_DMCFG_DMR_MASK                                 0xF00UL                             /**< Bit mask for CSEN_DMR */
#define _CSEN_DMCFG_DMR_DEFAULT                              0x00000000UL                        /**< Mode DEFAULT for CSEN_DMCFG */
#define CSEN_DMCFG_DMR_DEFAULT                               (_CSEN_DMCFG_DMR_DEFAULT << 8)      /**< Shifted mode DEFAULT for CSEN_DMCFG */
#define _CSEN_DMCFG_DMCR_SHIFT                               16                                  /**< Shift value for CSEN_DMCR */
#define _CSEN_DMCFG_DMCR_MASK                                0xF0000UL                           /**< Bit mask for CSEN_DMCR */
#define _CSEN_DMCFG_DMCR_DEFAULT                             0x00000000UL                        /**< Mode DEFAULT for CSEN_DMCFG */
#define CSEN_DMCFG_DMCR_DEFAULT                              (_CSEN_DMCFG_DMCR_DEFAULT << 16)    /**< Shifted mode DEFAULT for CSEN_DMCFG */
#define _CSEN_DMCFG_CRMODE_SHIFT                             20                                  /**< Shift value for CSEN_CRMODE */
#define _CSEN_DMCFG_CRMODE_MASK                              0x300000UL                          /**< Bit mask for CSEN_CRMODE */
#define _CSEN_DMCFG_CRMODE_DEFAULT                           0x00000000UL                        /**< Mode DEFAULT for CSEN_DMCFG */
#define _CSEN_DMCFG_CRMODE_DM10                              0x00000000UL                        /**< Mode DM10 for CSEN_DMCFG */
#define _CSEN_DMCFG_CRMODE_DM12                              0x00000001UL                        /**< Mode DM12 for CSEN_DMCFG */
#define _CSEN_DMCFG_CRMODE_DM14                              0x00000002UL                        /**< Mode DM14 for CSEN_DMCFG */
#define _CSEN_DMCFG_CRMODE_DM16                              0x00000003UL                        /**< Mode DM16 for CSEN_DMCFG */
#define CSEN_DMCFG_CRMODE_DEFAULT                            (_CSEN_DMCFG_CRMODE_DEFAULT << 20)  /**< Shifted mode DEFAULT for CSEN_DMCFG */
#define CSEN_DMCFG_CRMODE_DM10                               (_CSEN_DMCFG_CRMODE_DM10 << 20)     /**< Shifted mode DM10 for CSEN_DMCFG */
#define CSEN_DMCFG_CRMODE_DM12                               (_CSEN_DMCFG_CRMODE_DM12 << 20)     /**< Shifted mode DM12 for CSEN_DMCFG */
#define CSEN_DMCFG_CRMODE_DM14                               (_CSEN_DMCFG_CRMODE_DM14 << 20)     /**< Shifted mode DM14 for CSEN_DMCFG */
#define CSEN_DMCFG_CRMODE_DM16                               (_CSEN_DMCFG_CRMODE_DM16 << 20)     /**< Shifted mode DM16 for CSEN_DMCFG */
#define CSEN_DMCFG_DMGRDIS                                   (0x1UL << 28)                       /**< Disable delta modulator gain reduction. */
#define _CSEN_DMCFG_DMGRDIS_SHIFT                            28                                  /**< Shift value for CSEN_DMGRDIS */
#define _CSEN_DMCFG_DMGRDIS_MASK                             0x10000000UL                        /**< Bit mask for CSEN_DMGRDIS */
#define _CSEN_DMCFG_DMGRDIS_DEFAULT                          0x00000000UL                        /**< Mode DEFAULT for CSEN_DMCFG */
#define CSEN_DMCFG_DMGRDIS_DEFAULT                           (_CSEN_DMCFG_DMGRDIS_DEFAULT << 28) /**< Shifted mode DEFAULT for CSEN_DMCFG */

/* Bit fields for CSEN ANACTRL */
#define _CSEN_ANACTRL_RESETVALUE                             0x00000070UL                            /**< Default value for CSEN_ANACTRL */
#define _CSEN_ANACTRL_MASK                                   0x03730771UL                            /**< Mask for CSEN_ANACTRL */
#define CSEN_ANACTRL_CREFHALF                                (0x1UL << 0)                            /**< Reference capacitor divide by half. */
#define _CSEN_ANACTRL_CREFHALF_SHIFT                         0                                       /**< Shift value for CSEN_CREFHALF */
#define _CSEN_ANACTRL_CREFHALF_MASK                          0x1UL                                   /**< Bit mask for CSEN_CREFHALF */
#define _CSEN_ANACTRL_CREFHALF_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_CREFHALF_FULL                          0x00000000UL                            /**< Mode FULL for CSEN_ANACTRL */
#define _CSEN_ANACTRL_CREFHALF_HALF                          0x00000001UL                            /**< Mode HALF for CSEN_ANACTRL */
#define CSEN_ANACTRL_CREFHALF_DEFAULT                        (_CSEN_ANACTRL_CREFHALF_DEFAULT << 0)   /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_CREFHALF_FULL                           (_CSEN_ANACTRL_CREFHALF_FULL << 0)      /**< Shifted mode FULL for CSEN_ANACTRL */
#define CSEN_ANACTRL_CREFHALF_HALF                           (_CSEN_ANACTRL_CREFHALF_HALF << 0)      /**< Shifted mode HALF for CSEN_ANACTRL */
#define _CSEN_ANACTRL_IREFPROG_SHIFT                         4                                       /**< Shift value for CSEN_IREFPROG */
#define _CSEN_ANACTRL_IREFPROG_MASK                          0x70UL                                  /**< Bit mask for CSEN_IREFPROG */
#define _CSEN_ANACTRL_IREFPROG_DEFAULT                       0x00000007UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_IREFPROG_DEFAULT                        (_CSEN_ANACTRL_IREFPROG_DEFAULT << 4)   /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_IDACIREFS_SHIFT                        8                                       /**< Shift value for CSEN_IDACIREFS */
#define _CSEN_ANACTRL_IDACIREFS_MASK                         0x700UL                                 /**< Bit mask for CSEN_IDACIREFS */
#define _CSEN_ANACTRL_IDACIREFS_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_IDACIREFS_DEFAULT                       (_CSEN_ANACTRL_IDACIREFS_DEFAULT << 8)  /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_DUTYSCALE_SHIFT                        16                                      /**< Shift value for CSEN_DUTYSCALE */
#define _CSEN_ANACTRL_DUTYSCALE_MASK                         0x30000UL                               /**< Bit mask for CSEN_DUTYSCALE */
#define _CSEN_ANACTRL_DUTYSCALE_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_DUTYSCALE_DIV1                         0x00000000UL                            /**< Mode DIV1 for CSEN_ANACTRL */
#define _CSEN_ANACTRL_DUTYSCALE_DIV2                         0x00000001UL                            /**< Mode DIV2 for CSEN_ANACTRL */
#define _CSEN_ANACTRL_DUTYSCALE_DIV4                         0x00000002UL                            /**< Mode DIV4 for CSEN_ANACTRL */
#define _CSEN_ANACTRL_DUTYSCALE_DIV8                         0x00000003UL                            /**< Mode DIV8 for CSEN_ANACTRL */
#define CSEN_ANACTRL_DUTYSCALE_DEFAULT                       (_CSEN_ANACTRL_DUTYSCALE_DEFAULT << 16) /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_DUTYSCALE_DIV1                          (_CSEN_ANACTRL_DUTYSCALE_DIV1 << 16)    /**< Shifted mode DIV1 for CSEN_ANACTRL */
#define CSEN_ANACTRL_DUTYSCALE_DIV2                          (_CSEN_ANACTRL_DUTYSCALE_DIV2 << 16)    /**< Shifted mode DIV2 for CSEN_ANACTRL */
#define CSEN_ANACTRL_DUTYSCALE_DIV4                          (_CSEN_ANACTRL_DUTYSCALE_DIV4 << 16)    /**< Shifted mode DIV4 for CSEN_ANACTRL */
#define CSEN_ANACTRL_DUTYSCALE_DIV8                          (_CSEN_ANACTRL_DUTYSCALE_DIV8 << 16)    /**< Shifted mode DIV8 for CSEN_ANACTRL */
#define _CSEN_ANACTRL_TRSTPROG_SHIFT                         20                                      /**< Shift value for CSEN_TRSTPROG */
#define _CSEN_ANACTRL_TRSTPROG_MASK                          0x700000UL                              /**< Bit mask for CSEN_TRSTPROG */
#define _CSEN_ANACTRL_TRSTPROG_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_TRSTPROG_DEFAULT                        (_CSEN_ANACTRL_TRSTPROG_DEFAULT << 20)  /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_BIASPROG_SHIFT                         24                                      /**< Shift value for CSEN_BIASPROG */
#define _CSEN_ANACTRL_BIASPROG_MASK                          0x3000000UL                             /**< Bit mask for CSEN_BIASPROG */
#define _CSEN_ANACTRL_BIASPROG_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for CSEN_ANACTRL */
#define _CSEN_ANACTRL_BIASPROG_ONEX                          0x00000000UL                            /**< Mode ONEX for CSEN_ANACTRL */
#define _CSEN_ANACTRL_BIASPROG_TWOX                          0x00000001UL                            /**< Mode TWOX for CSEN_ANACTRL */
#define _CSEN_ANACTRL_BIASPROG_ONETENTH                      0x00000002UL                            /**< Mode ONETENTH for CSEN_ANACTRL */
#define _CSEN_ANACTRL_BIASPROG_HALF                          0x00000003UL                            /**< Mode HALF for CSEN_ANACTRL */
#define CSEN_ANACTRL_BIASPROG_DEFAULT                        (_CSEN_ANACTRL_BIASPROG_DEFAULT << 24)  /**< Shifted mode DEFAULT for CSEN_ANACTRL */
#define CSEN_ANACTRL_BIASPROG_ONEX                           (_CSEN_ANACTRL_BIASPROG_ONEX << 24)     /**< Shifted mode ONEX for CSEN_ANACTRL */
#define CSEN_ANACTRL_BIASPROG_TWOX                           (_CSEN_ANACTRL_BIASPROG_TWOX << 24)     /**< Shifted mode TWOX for CSEN_ANACTRL */
#define CSEN_ANACTRL_BIASPROG_ONETENTH                       (_CSEN_ANACTRL_BIASPROG_ONETENTH << 24) /**< Shifted mode ONETENTH for CSEN_ANACTRL */
#define CSEN_ANACTRL_BIASPROG_HALF                           (_CSEN_ANACTRL_BIASPROG_HALF << 24)     /**< Shifted mode HALF for CSEN_ANACTRL */

/* Bit fields for CSEN IF */
#define _CSEN_IF_RESETVALUE                                  0x00000000UL                          /**< Default value for CSEN_IF */
#define _CSEN_IF_MASK                                        0x0000001FUL                          /**< Mask for CSEN_IF */
#define CSEN_IF_CMP                                          (0x1UL << 0)                          /**< CSEN Digital Comparator Interrupt Flag */
#define _CSEN_IF_CMP_SHIFT                                   0                                     /**< Shift value for CSEN_CMP */
#define _CSEN_IF_CMP_MASK                                    0x1UL                                 /**< Bit mask for CSEN_CMP */
#define _CSEN_IF_CMP_DEFAULT                                 0x00000000UL                          /**< Mode DEFAULT for CSEN_IF */
#define CSEN_IF_CMP_DEFAULT                                  (_CSEN_IF_CMP_DEFAULT << 0)           /**< Shifted mode DEFAULT for CSEN_IF */
#define CSEN_IF_CONV                                         (0x1UL << 1)                          /**< CSEN Conversion Done Interrupt Flag */
#define _CSEN_IF_CONV_SHIFT                                  1                                     /**< Shift value for CSEN_CONV */
#define _CSEN_IF_CONV_MASK                                   0x2UL                                 /**< Bit mask for CSEN_CONV */
#define _CSEN_IF_CONV_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for CSEN_IF */
#define CSEN_IF_CONV_DEFAULT                                 (_CSEN_IF_CONV_DEFAULT << 1)          /**< Shifted mode DEFAULT for CSEN_IF */
#define CSEN_IF_EOS                                          (0x1UL << 2)                          /**< CSEN End of Scan Interrupt Flag. */
#define _CSEN_IF_EOS_SHIFT                                   2                                     /**< Shift value for CSEN_EOS */
#define _CSEN_IF_EOS_MASK                                    0x4UL                                 /**< Bit mask for CSEN_EOS */
#define _CSEN_IF_EOS_DEFAULT                                 0x00000000UL                          /**< Mode DEFAULT for CSEN_IF */
#define CSEN_IF_EOS_DEFAULT                                  (_CSEN_IF_EOS_DEFAULT << 2)           /**< Shifted mode DEFAULT for CSEN_IF */
#define CSEN_IF_DMAOF                                        (0x1UL << 3)                          /**< CSEN DMA Overflow Interrupt Flag. */
#define _CSEN_IF_DMAOF_SHIFT                                 3                                     /**< Shift value for CSEN_DMAOF */
#define _CSEN_IF_DMAOF_MASK                                  0x8UL                                 /**< Bit mask for CSEN_DMAOF */
#define _CSEN_IF_DMAOF_DEFAULT                               0x00000000UL                          /**< Mode DEFAULT for CSEN_IF */
#define CSEN_IF_DMAOF_DEFAULT                                (_CSEN_IF_DMAOF_DEFAULT << 3)         /**< Shifted mode DEFAULT for CSEN_IF */
#define CSEN_IF_APORTCONFLICT                                (0x1UL << 4)                          /**< APORT Conflict Interrupt Flag */
#define _CSEN_IF_APORTCONFLICT_SHIFT                         4                                     /**< Shift value for CSEN_APORTCONFLICT */
#define _CSEN_IF_APORTCONFLICT_MASK                          0x10UL                                /**< Bit mask for CSEN_APORTCONFLICT */
#define _CSEN_IF_APORTCONFLICT_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for CSEN_IF */
#define CSEN_IF_APORTCONFLICT_DEFAULT                        (_CSEN_IF_APORTCONFLICT_DEFAULT << 4) /**< Shifted mode DEFAULT for CSEN_IF */

